import pyfiglet
import pyfiglet as pf

# Welcome message

res = pf.figlet_format("Welcome To Serpent Academy!", font="slant")
styled_text = pyfiglet.figlet_format("serpent", font='doom')
print(res)


def wand():
    print('''     
                   '* *
 _____________,_,*''*
|_____________|_|
    
    ''')
wand()

def sword():
    print(''''
        /|____________
0|===|*|  ____________|
        \| 
        ''')


sword()


def school():
    print('''         
      
    |>>>                                                     |>>>
    |                    |>>>          |>>>                 |
    *                     |             |                    *
   / \                    *             *                    / |
  /___\                 _/ \           / \_                 /___|
  [   ]                |/   \_________/   \|                [   ]
  [ I ]                /     \       /     \                [ I ]
  [   ]_ _ _          /       \     /       \          _ _ _[   ]
  [   ] U U |        {#########}   {#########}        | U U [   ]
  [   ]====/          \=======/     \=======/          \====[   ]
  [   ]    |           |   I |_ _ _ _| I   |           |    [   ]
  [___]    |_ _ _ _ _ _|     | U U U |     |_ _ _ _ _ _|    [___]
  \===/  I | U U U U U |     |=======|     | U U U U U | I  \===/
   \=/     |===========| I   | + W + |   I |===========|     \=/
    |  I   |           |     |_______|     |           |   I  |
    |      |           |     |||||||||     |           |      |
    |      |           |   I ||vvvvv|| I   |           |      |
_-_-|______|-----------|_____||     ||_____|-----------|______|-_-_
   /________\         /______||     ||______\         /________\

       
    ''')


school()


def books():
    print('''
      ______ ______
    _/      Y      |
   // ~~ ~~ | ~~ ~  |
  // ~ ~ ~~ | ~~~ ~~ |      
 //________.|.________||     
`----------`-'----------'
    
    ''')


books()


def tree():
    print('''

       _-_             
   \/~~   ~~\/
./~~         ~~\.
{               }
 \  _-     -_  /
   ~  \| |/  ~
_- -   | | _- _
  _ -  | |   - _
      |/ \|       
    ''')


tree()

def woods():
    print('''
↟ ⍋ ꋧ ┈┈┈ ∘* ┈┈ 𐂂 ┈┈┈ *∘ ┈┈ ꋧ ⍋ ↟ 
         Elven  Woods
↟ ⍋ ꋧ ┈┈┈ ∘* ┈┈ 𐂂 ┈┈┈ *∘ ┈┈ ꋧ ⍋ ↟
''')


woods()

def lake():
    print('''
⋆.ೃ࿔.𖥔 ݁ ˖*:･༄, 𓊝⋆.ೃ࿔.𖥔
     Lucaria Lake
⋆.ೃ࿔.𖥔 ݁ ˖*:･༄, 𓊝⋆.ೃ࿔.𖥔
    ''')


lake()

def courtyard():
    print('''
    
     . ✦　˚. ★⋆. . ★⋆.
　˚　✦　　Courtyard　. ★⋆.
　　˚　. ★⋆. 　*　 ⋆. ..
    
    ''')
courtyard()
def boat():
    print('''
                 ~.
                / |`
               /  |
              /___|__
            \----------/
    ~~~~~~~~~`~~~~~~~~~'~~~~~~~~~~~

''')


boat()